ProgessBase/DataProcessors/КонтурEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КонтурEDI</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыКлиентСервер</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТребуемоеДействие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПартнерПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаДоставкиПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаДоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СообщениеСсылка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Направление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Иконка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопРеквизит1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопРеквизит2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопРеквизит3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетСверкаСФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Накладная</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФактура</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусТорг12ВДД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЭСФВДД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПриемки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриемки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНакладнойВ1С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСФВ1С</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаТорг12ВДД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЭСФВДД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийТорг12ВДД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийЭСФВДД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставЭДО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Создано</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ProgessBase/DataProcessors/КонтурEDI/Forms/Сервис_СвязанныеСообщенияУправляемая/Ext/Form/Module.bsl
&НаСервере
Перем ОбработкаОбъект;

&НаСервере
//инициализация модуля и его экспортных функций
Функция МодульОбъекта()

	Если ОбработкаОбъект=Неопределено Тогда
		
		Если Параметры.КэшироватьМодульОбъекта Тогда
			Если Параметры.АдресХранилища<>"" Тогда
				_Структура = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
				Если ТипЗнч(_Структура) = Тип("Структура") Тогда
					_Структура.Свойство("ОбработкаОбъект",ОбработкаОбъект);
				КонецЕсли;
			КонецЕсли;
			
			Если ОбработкаОбъект=Неопределено Тогда
				ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
				ОбработкаОбъект.ИнициализироватьПодключаемыеМодули();
				Параметры.АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("ОбработкаОбъект",ОбработкаОбъект),УникальныйИдентификатор);
				ОбработкаОбъект.IDОсновнойФормы = Параметры.IDОсновнойФормы;
			КонецЕсли;
		Иначе
			ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
			ОбработкаОбъект.ИнициализироватьПодключаемыеМодули();
			ОбработкаОбъект.IDОсновнойФормы = Параметры.IDОсновнойФормы;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОбъектаМодально(ИмяФормы, ПараметрыФормы = Неопределено, ИмяОбработчика = Неопределено, ПараметрыОбработчика = Неопределено, ВладелецОбработчика = Неопределено, РежимБлокирования = Неопределено)
	//отказ от модальности
	Если РежимБлокирования = Неопределено Тогда
		РежимБлокирования =	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	Если ВладелецОбработчика = Неопределено Тогда
		ВладелецОбработчика = ЭтаФорма;
	КонецЕсли;
	
	Если ВладелецФормы = Неопределено Тогда
		ВладелецФормы =	ЭтаФорма.ВладелецФормы;
	КонецЕсли;
	
	Если ИмяОбработчика = Неопределено Тогда
		ОписаниеОбработчика = Неопределено;
	Иначе	
		Выполнить("ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, ВладелецОбработчика, ПараметрыОбработчика)");
	КонецЕсли;
	
	Выполнить("ОткрытьФорму(ИмяФормы, ПараметрыФормы, ВладелецФормы, , , , ОписаниеОбработчика, РежимБлокирования)");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФормуОбработки(ИмяФормы, ПараметрыФормы = Неопределено , ВладелецФормы  = Неопределено, КлючУникальности = Неопределено, ЗакрыватьПризакрытииВладельца = Ложь)
	
	Если ВладелецФормы = Неопределено Тогда
		ВладелецФормы =	ЭтаФорма.ВладелецФормы;
	КонецЕсли;
	
	ПолучаемаяФорма =	ПолучитьФорму(ПутьКФормам + ИмяФормы
										, ПараметрыФормы
										,
										, КлючУникальности);
	
	Если НЕ ВладелецФормы = Неопределено Тогда
		ПолучаемаяФорма.ВладелецФормы =	ВладелецФормы;
	КонецЕсли;
	
	Возврат ПолучаемаяФорма;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументСсылка 	= Параметры.ДокументСсылка;
	СообщениеСсылка = Параметры.СообщениеСсылка;
	
    Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Сообщить("Не удалось найти связанные сообщения!");
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Параметры.МодальностьЗапрещена= МодульОбъекта().МодальностьЗапрещена();

	ОбновитьДеревоДокументов();
	
	ПутьКФормам = МодульОбъекта().Метаданные().ПолноеИмя() + ".Форма.";
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоДокументов()
	
	ДокументСсылка 	= Параметры.ДокументСсылка;
	СообщениеСсылка = Параметры.СообщениеСсылка;
	
	ДеревоДокументов1 = МодульОбъекта().ПолучитьСвязанныеСообщения(СообщениеСсылка, ДокументСсылка);
	
	УстановитьИконкиПодстрок(ДеревоДокументов1); 
	
	ЗначениеВРеквизитФормы(ДеревоДокументов1, "ДеревоДокументов");
	
	
	Если МодульОбъекта().НастройкиМодуля.МыПоставщик Тогда
		Если ЗначениеЗаполнено(ДокументСсылка)
			И ТипЗнч(ДокументСсылка) = Тип(МодульОбъекта().ПолучитьТипЗначенияОбъекта("ВходящийЗаказПокупателя"))
		Тогда
			//покажем вторую закладку и кнопку
			Элементы.ДеревоДокументовКоманднаяПанельСообщенийОтвязатьДокумент.Доступность = Истина;
			Элементы.СтраницаДокументыДляПривязки.Видимость = Истина;
			
			ДатаНач = ДокументСсылка.Дата;
			ДатаКон = ДокументСсылка.Дата;
			
			КоманднаяПанельПохожихДокументовОбновитьСервер();
		Иначе
			//скроем вторую закладку и кнопку
			Элементы.ДеревоДокументовКоманднаяПанельСообщенийОтвязатьДокумент.Доступность = Ложь;
			Элементы.СтраницаДокументыДляПривязки.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура КоманднаяПанельПохожихДокументовОбновитьСервер()
	
	ТаблицаПохожихДокументов1 = МодульОбъекта().ПолучитьТаблицуДокументовДляПривязки_к_ORDERS(ДокументСсылка,ДатаНач,ДатаКон);
	ЗначениеВРеквизитФормы(ТаблицаПохожихДокументов1, "ТаблицаПохожихДокументов");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДерево(Команда)
	ОбновитьДеревоДокументов();
	
	РазвернутьУзлыДерева();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУзлыДерева()
    КоллекцияЭлементовДерева =  ДеревоДокументов.ПолучитьЭлементы();
                                    
    //Развернуть дерево 
 
    Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
        ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
        Элементы.ДеревоДокументов.Развернуть(ИдентификаторСтроки, Истина);
    КонецЦикла;   
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	ОткрытьФормуТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭлемент(Команда)
	ОткрытьФормуТекущейСтроки();
КонецПроцедуры

&НаСервере
Процедура УстановитьИконкиПодстрок(Дерево)
Для Каждого Подстрока Из Дерево.Строки Цикл

//обработка подстроки 
  	Если Подстрока.Вид = "Сообщение" Тогда
		Если Подстрока.Направление = "Входящее" Тогда
			Подстрока.Иконка=0;
		Иначе
			Подстрока.Иконка=1;
		КонецЕсли;
		//Если Подстрока.Ссылка = СообщениеСсылка Тогда
		//	УСЛОВНОЕ ОФОРМЛЕНИЕ			
		//КонецЕсли;
	ИначеЕсли Подстрока.Вид = "ГруппаСообщений" Тогда
			Подстрока.Иконка=5;
	ИначеЕсли Подстрока.Вид = "Документ" Тогда
		Если Подстрока.Проведен = Истина Тогда
			Подстрока.Иконка=2;
		ИначеЕсли Подстрока.ПометкаУдаления = Истина Тогда
			Подстрока.Иконка=4;
		Иначе
			Подстрока.Иконка=3;
		КонецЕсли;
		//Если Подстрока.Ссылка = Параметры.ДокументСсылка и не ЗначениеЗаполнено(Параметры.СообщениеСсылка) Тогда
		//	УСЛОВНОЕ ОФОРМЛЕНИЕ			
		//КонецЕсли;
	КонецЕсли;	

//
УстановитьИконкиПодстрок(Подстрока);

КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФормуТекущейСтроки();
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуТекущейСтроки()
	
	ТекДанные = Элементы.ДеревоДокументов.ТекущиеДанные;
	Состояние("Открываю форму сообщения");
	
	Если НЕ ТекДанные = Неопределено Тогда
		Если ТекДанные.Иконка = 2
			или ТекДанные.Иконка = 3
			или ТекДанные.Иконка = 4
			Тогда  //документ
			ОткрытьЗначение(ТекДанные.Ссылка);
			
		Иначе
			Если ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
				Если ТипСообщенияДоступенСервер(ТекДанные.ТипСообщения) Тогда
					
					СсылкаНаСообщение = ТекДанные.Ссылка;	
					
					ПараметрыФормы = Новый Структура;
					ПараметрыФормы.Вставить("СообщениеСсылка",	СсылкаНаСообщение);
					ПараметрыФормы.Вставить("ТипСообщения",		ПолучитьРеквизитСсылки(СсылкаНаСообщение,"ТипСообщения"));
					ПараметрыФормы.Вставить("Направление",		ПолучитьРеквизитСсылки(СсылкаНаСообщение,"Направление"));
					ПараметрыФормы.Вставить("Документ1С",		ПолучитьРеквизитСсылки(СсылкаНаСообщение,"Документ"));
					ПараметрыФормы.Вставить("РежимРаботы",		Параметры.РежимРаботы);
					ПараметрыФормы.Вставить("ТолькоПросмотр",	истина);
					
					Если Параметры.МодальностьЗапрещена Тогда 
						Выполнить("ОткрытьФормуОбъектаМодально(ПутьКФормам + ""ФормаСообщенияУправляемая"", ПараметрыФормы,)");//,ДополнительныеПараметры);
					Иначе
						ПолучитьФормуОбработки("ФормаСообщенияУправляемая",ПараметрыФормы).ОткрытьМодально();
					КонецЕсли;
				Иначе
					ТекстПредупреждения = "Недостаточно прав для работы с сообщением";
					Если Параметры.МодальностьЗапрещена Тогда 
						Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
					Иначе
						Предупреждение(ТекстПредупреждения,,"Контур.EDI");
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
			
			ОбновитьДеревоДокументов();
			РазвернутьУзлыДерева();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТипСообщенияДоступенСервер(ТипСообщения)
	
	Возврат МодульОбъекта().ТипСообщенияДоступенПользователюEDI(ТипСообщения);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылки(СсылкаНаСообщение,ИмяРеквизита)
	ЗначениеРеквизита=неопределено;
	Выполнить("ЗначениеРеквизита=СсылкаНаСообщение."+ИмяРеквизита);
	Возврат ЗначениеРеквизита;
	
КонецФункции


&НаКлиенте
Процедура КоманднаяПанельПохожихДокументовОткрыть(Команда)
	
	Если Элементы.ТаблицаПохожихДокументов.ТекущиеДанные<>Неопределено и ЗначениеЗаполнено(Элементы.ТаблицаПохожихДокументов.ТекущиеДанные.Ссылка) тогда
		
		ТекСсылка = Элементы.ТаблицаПохожихДокументов.ТекущиеДанные.Ссылка;
		Если Параметры.МодальностьЗапрещена Тогда
			Выполнить("ПоказатьЗначение(,ТекСсылка)"); 
		Иначе
			ОткрытьЗначение(ТекСсылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипЗначенияОбъектаВызовСервера(НазваниеОбъектаEDI)
	Возврат МодульОбъекта().ПолучитьТипЗначенияОбъекта(НазваниеОбъектаEDI);
КонецФункции

&НаКлиенте
Процедура КоманднаяПанельСообщенийОтвязатьДокумент(Команда)
	
	ТекСтрока = Элементы.ДеревоДокументов.ТекущиеДанные;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		Если ТекСтрока.Вид = "Документ"
			И ТипЗнч(ТекСтрока.Ссылка) = Тип(ПолучитьТипЗначенияОбъектаВызовСервера("ВходящийЗаказПокупателя"))	Тогда
			
			ОтвязываемыйДокумент = ТекСтрока.Ссылка;
			
			Если ОтвязываемыйДокумент=ДокументСсылка Тогда
				ТекстПредупреждения="Нельзя отвязывать текущий документ";
				Если Параметры.МодальностьЗапрещена Тогда 
					Выполнить("ПоказатьПредупреждение(,ТекстПредупреждения,,""Контур.EDI"")");
				Иначе
					Предупреждение(ТекстПредупреждения,,"Контур.EDI");
				КонецЕсли;
				Возврат;
			КонецЕсли;	
			
			ТекстВопроса ="Отвязать от данного заказа документ "+ОтвязываемыйДокумент+"?";
			КнопкиВопроса=новый СписокЗначений;
			КнопкиВопроса.Добавить("Отвязать");
			КнопкиВопроса.Добавить("Отмена");
			ДопПараметрДляПередачиВОбработчик=новый Структура;
			ДопПараметрДляПередачиВОбработчик.Вставить("ОтвязываемыйДокумент",ОтвязываемыйДокумент);
			РезультатВопроса = Неопределено;
			
			Если Параметры.МодальностьЗапрещена Тогда
				Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ОбработчикСогласияОтвязкиДокумента"", ЭтаФорма, ДопПараметрДляПередачиВОбработчик), ТекстВопроса, КнопкиВопроса,,,""Контур.EDI"")");
			Иначе
				РезультатВопроса = Вопрос(ТекстВопроса, КнопкиВопроса,,,"Контур.EDI");
				ОбработчикСогласияОтвязкиДокумента(РезультатВопроса,ДопПараметрДляПередачиВОбработчик);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикСогласияОтвязкиДокумента(РезультатВопроса,ДопПараметрДляПередачиВОбработчик) Экспорт
	
	Если РезультатВопроса="Отвязать" Тогда 	
		ОтвязываемыйДокумент=ДопПараметрДляПередачиВОбработчик.ОтвязываемыйДокумент;
		УбратьВиртуальныйORDERSВызовСервера(ОтвязываемыйДокумент);
		
	КонецЕсли;
	
	ОбновитьДеревоДокументов();
	
КонецПроцедуры

&НаСервере
Процедура УбратьВиртуальныйORDERSВызовСервера(ОтвязываемыйДокумент)
	
	ТабВиртуальныхСообщений = МодульОбъекта().ПолучитьВиртуальныеСвязанныеORDERS(ОтвязываемыйДокумент);
	
	Если ТабВиртуальныхСообщений.Количество()=1 Тогда
		Сообщить("Это единственный привязанный документ, его невозможно отвязать");
		Возврат;
	КонецЕсли;	
	МодульОбъекта().УбратьВиртуальныйORDERS(ОтвязываемыйДокумент);
	
КонецПроцедуры // УбратьВиртуальныйORDERSВызовСервера()

&НаКлиенте
Процедура КоманднаяПанельПохожихДокументовОбновить(Команда)
	
	Состояние("Строю список похожих документов 1С за период...",50,,);
	КоманднаяПанельПохожихДокументовОбновитьСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельСообщенийПривязатьНакладную(Команда)
	
	ТекСтрока = Элементы.ТаблицаПохожихДокументов.ТекущиеДанные;
	
	Если ТекСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументДляПривязки = ТекСтрока.Ссылка;
	//создаем копию ORDERS.
	
	ДобавитьВиртуальныйORDERSВызовСервера(ДокументСсылка,ДокументДляПривязки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВиртуальныйORDERSВызовСервера(ТекущийДокумент,ДокументДляПривязки) Экспорт//ТекущийДокумент,ПривязываемыйДокумент
	
	МодульОбъекта().ДобавитьВиртуальныйORDERS(ТекущийДокумент,ДокументДляПривязки);
	
	ОбновитьДеревоДокументов();//перерисовать
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	Если ДатаНач>ДатаКон Тогда 
		ДатаНач = ДатаКон;
	КонецЕсли;	
	
	КоманднаяПанельПохожихДокументовОбновить("");
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	Если ДатаКон<ДатаНач Тогда 
		ДатаКон = ДатаНач;
	КонецЕсли;	
	
	КоманднаяПанельПохожихДокументовОбновить("");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПохожихДокументовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПохожихДокументовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПохожихДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КоманднаяПанельПохожихДокументовОткрыть("");
КонецПроцедуры
